# Generated with `brew bundle dump`; this Brewfile is the source of truth for
# CLI packages. Install/sync with `brew bundle install --file=Brewfile`;
# `brew bundle cleanup` prunes anything not listed. Regenerate with
# `brew bundle dump --force --file=Brewfile` (then re-curate).
tap "elastic/tap"
tap "jesseduffield/lazygit"
tap "kardolus/chatgpt-cli"
tap "railwaycat/emacsmacport"
tap "temporalio/brew"
tap "xo/xo"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Color management engine supporting ICC profiles
brew "little-cms2"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Multi-shell multi-command argument completer
brew "carapace"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Password manager
brew "pass"
# Unix pager optimized for psql
brew "pspg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to build, change, and version infrastructure
brew "terraform"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Converts a ttyrec file into gif files
brew "ttygif"
# Watch files and take action when they change
brew "watchman"
# Command-line tool to help build, run, and test web extensions
brew "web-ext"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Universal command-line interface for SQL databases (used by the `db` helper).
# Not a brew "leaf", so `brew bundle dump` omits it — keep this line by hand.
brew "xo/xo/usql"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/google/go-licenses"
go "github.com/rogpeppe/godef"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "github.com/koron/iferr"
go "robpike.io/ivy"
go "github.com/moderato-app/live-pprof"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "github.com/vektra/mockery/v2"
go "github.com/fatih/motion"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/lotusirous/gostdsym/stdsym"
go "golang.org/x/tools/cmd/stringer"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/wailsapp/wails/v2/cmd/wails"
go "go.temporal.io/sdk/contrib/tools/workflowcheck"
npm "corepack"
