# .zsh_plugins.txt
rupa/z
zsh-users/zsh-completions

ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/lein/_lein
ohmyzsh/ohmyzsh path:plugins/dommand-not-found
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:themes/robbyrussell.zsh-theme

zsh-users/zsh-syntax-highlighting
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
